Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/Atmel.SAMS70_DFP.pdsc
      <condition id="ATSAMS70J19">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q20B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N19B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70N19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N19">
         <require Dvendor="Atmel:3" Dname="ATSAMS70N19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q21B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N20">
         <require Dvendor="Atmel:3" Dname="ATSAMS70N20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70J21">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70J20">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N21B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70N21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70J19B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q19">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q19"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q21">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q21"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q19B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q19B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70J21B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J21B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70J20B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70J20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70Q20">
         <require Dvendor="Atmel:3" Dname="ATSAMS70Q20"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAMS70N20B">
         <require Dvendor="Atmel:3" Dname="ATSAMS70N20B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70N21">
         <description>Headers and startup code for Atmel ATSAMS70N21</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/gcc/startup_sams70n21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/system_sams70n21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70a/gcc/gcc/sams70n21_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70a/gcc/gcc/sams70n21_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/system_SAMS70.c"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/startup_SAMS70.s"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/iar/startup_sams70n21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/system_sams70n21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70a/iar/config/linker/Microchip/atsams70n21/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70a/iar/config/linker/Microchip/atsams70n21/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70J19">
         <description>Headers and startup code for Atmel ATSAMS70J19</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/gcc/startup_sams70j19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/system_sams70j19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70a/gcc/gcc/sams70j19_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70a/gcc/gcc/sams70j19_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/system_SAMS70.c"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/startup_SAMS70.s"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/iar/startup_sams70j19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/system_sams70j19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70a/iar/config/linker/Microchip/atsams70j19/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70a/iar/config/linker/Microchip/atsams70j19/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70Q20B">
         <description>Headers and startup code for Atmel ATSAMS70Q20B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70q20b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70q20b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70q20b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70q20b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70q20b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70q20b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70N19B">
         <description>Headers and startup code for Atmel ATSAMS70N19B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70n19b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70n19b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70n19b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70n19b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70n19b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70n19b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70N19">
         <description>Headers and startup code for Atmel ATSAMS70N19</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/gcc/startup_sams70n19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/system_sams70n19.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70a/gcc/gcc/sams70n19_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70a/gcc/gcc/sams70n19_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/system_SAMS70.c"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/startup_SAMS70.s"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/iar/startup_sams70n19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/system_sams70n19.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70a/iar/config/linker/Microchip/atsams70n19/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70a/iar/config/linker/Microchip/atsams70n19/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70Q21B">
         <description>Headers and startup code for Atmel ATSAMS70Q21B</description>
         <files>
            <file condition="C" category="include" name="sams70b/include"/>
            <file condition="C" category="header" name="sams70b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/gcc/startup_sams70q21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70b/gcc/system_sams70q21b.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70b/gcc/gcc/sams70q21b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70b/gcc/gcc/sams70q21b_sram.ld"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/iar/startup_sams70q21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70b/iar/system_sams70q21b.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70b/iar/config/linker/Microchip/atsams70q21b/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70b/iar/config/linker/Microchip/atsams70q21b/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="2.3.0"
                 condition="ATSAMS70N20">
         <description>Headers and startup code for Atmel ATSAMS70N20</description>
         <files>
            <file condition="C" category="include" name="sams70a/include"/>
            <file condition="C" category="header" name="sams70a/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sams70a/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sams70a/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/gcc/startup_sams70n20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sams70a/gcc/system_sams70n20.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sams70a/gcc/gcc/sams70n20_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sams70a/gcc/gcc/sams70n20_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/system_SAMS70.c"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sams70a/armcc/arm/startup_SAMS70.s"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/iar/startup_sams70n20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sams70a/iar/system_sams70n20.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sams70a/iar/config/linker/Microchip/atsams70n20/flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sams70a/iar/config/linker/Microchip/atsams70n20/sram.icf"
                  attr="config"/>
         </files>
      </component>
